app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if !@artist
        redirect_to artists_path, alert: "Artist not found"
      else
      @songs = @artist.songs
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE (2hy) LIMIT ?  [["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])
      if !@song
        redirect_to artist_songs_path, alert: "Song not found"
      end
    else
      @song = Song.find(params[:id])

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Test Song 1"], ["created_at", "2020-02-01 20:40:13.962423"], ["updated_at", "2020-02-01 20:40:13.962423"], ["artist_id", 5]]
---
  def create
    @song = Song.new(song_params)

    if @song.save