app/controllers/songs_controller.rb

  def show
    @songs = Song.where(id: params[:id])

    if params[:artist_id]
      @songs = @songs.where(artist_id: params[:artist_id])
    end

    @song = @songs.first
---
SELECT "songs"."id" FROM "songs"